GHB2/src/Catalogs/гхб_ПерсональныеКабинетыТакси/гхб_ПерсональныеКабинетыТакси.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ПерсональныеКабинетыТакси</name>
  <comment>#14311</comment>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СлужбаТакси</name>
    <type>
      <types>CatalogRef.гхб_СлужбыТакси</types>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/InformationRegisters/гхб_ДанныеПерсональныхКабинетовТакси/гхб_ДанныеПерсональныхКабинетовТакси.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ДанныеПерсональныхКабинетовТакси</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.гхб_ЦФО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </resources>
  <dimensions>
    <name>ПерсональныйКабинетТакси</name>
    <type>
      <types>CatalogRef.гхб_ПерсональныеКабинетыТакси</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ВидыОперацийУПКТ/гхб_ВидыОперацийУПКТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ВидыОперацийУПКТ</name>
  <enumValues>
    <name>ОткрытиеКабинета</name>
  </enumValues>
  <enumValues>
    <name>РедактированиеКабинета</name>
  </enumValues>
  <enumValues>
    <name>БлокированиеКабинета</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_УПКТ/гхб_УПКТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_УПКТ</name>
  <basedOn>Document.гхб_УПКТ</basedOn>
  <registerRecords>InformationRegister.гхб_ДанныеПерсональныхКабинетовТакси</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гхб_ВидыОперацийУПКТ</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.гхб_ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныйКабинетТакси</name>
    <type>
      <types>CatalogRef.гхб_ПерсональныеКабинетыТакси</types>
    </type>
  </attributes>
  <attributes>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>еМайлСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.гхб_УПКТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Финансист</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонФинансиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>еМайлРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>еМайлФинансиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

GHB2/src/Catalogs/гхб_ЦФО/гхб_ЦФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ЦФО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>GUIDБазыХолдинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппаРИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛицаБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппаБаза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НетСоответствияВУчетныхБазах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_ПерсональныеКабинетыТакси/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьУчетныеДанные();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьУчетныеДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Наименование);
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ЗаполнитьУчетныеДанные()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	гхб_ДанныеПерсональныхКабинетовТаксиОткрытие.ПерсональныйКабинетТакси КАК ПерсональныйКабинетТакси,
	|	гхб_ДанныеПерсональныхКабинетовТаксиОткрытие.Период КАК ДатаОткрытия
	|ПОМЕСТИТЬ втДатыОткрытия
	|ИЗ
	|	РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних(, Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гхб_ВидыОперацийУПКТ.ОткрытиеКабинета)) КАК гхб_ДанныеПерсональныхКабинетовТаксиОткрытие
	|ГДЕ
	|	гхб_ДанныеПерсональныхКабинетовТаксиОткрытие.ПерсональныйКабинетТакси = &ПерсональныйКабинетТакси
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	гхб_ДанныеПерсональныхКабинетовТаксиБлокирование.ПерсональныйКабинетТакси КАК ПерсональныйКабинетТакси,
	|	гхб_ДанныеПерсональныхКабинетовТаксиБлокирование.Период КАК ДатаБлокирования
	|ПОМЕСТИТЬ втДатыЗакрытия
	|ИЗ
	|	РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних(, Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гхб_ВидыОперацийУПКТ.БлокированиеКабинета)) КАК гхб_ДанныеПерсональныхКабинетовТаксиБлокирование
	|ГДЕ
	|	гхб_ДанныеПерсональныхКабинетовТаксиБлокирование.ПерсональныйКабинетТакси = &ПерсональныйКабинетТакси
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Справочникгхб_ПерсональныеКабинетыТакси.Ссылка КАК Ссылка,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Код КАК Код,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Наименование КАК Наименование,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Логин КАК Логин,
	|	Справочникгхб_ПерсональныеКабинетыТакси.СлужбаТакси КАК СлужбаТакси,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Лимит КАК Лимит,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.БазаХолдинга, ЗНАЧЕНИЕ(Справочник.гхб_БазыХолдинга.ПустаяСсылка)) КАК БазаХолдинга,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.гхб_ОрганизацииБазХолдинга.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Сотрудник, ЗНАЧЕНИЕ(Справочник.гхб_СотрудникиБазХолдинга.ПустаяСсылка)) КАК Сотрудник,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Дивизион, ЗНАЧЕНИЕ(Справочник.гхб_Дивизионы.ПустаяСсылка)) КАК Дивизион,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.ЦФО, ЗНАЧЕНИЕ(Справочник.гхб_ЦФО.ПустаяСсылка)) КАК ЦФО,
	|	ЕСТЬNULL(гхб_УПКТ.ТелефонСотрудника, """") КАК ТелефонСотрудника,
	|	ЕСТЬNULL(гхб_УПКТ.еМайлСотрудника, """") КАК еМайлСотрудника,
	|	ЕСТЬNULL(гхб_УПКТ.Руководитель, ЗНАЧЕНИЕ(Справочник.гхб_ФизическиеЛица.ПустаяСсылка)) КАК Руководитель,
	|	ЕСТЬNULL(гхб_УПКТ.Финансист, ЗНАЧЕНИЕ(Справочник.гхб_ФизическиеЛица.ПустаяСсылка)) КАК Финансист,
	|	ЕСТЬNULL(гхб_УПКТ.ТелефонРуководителя, """") КАК ТелефонРуководителя,
	|	ЕСТЬNULL(гхб_УПКТ.ТелефонФинансиста, """") КАК ТелефонФинансиста,
	|	ЕСТЬNULL(гхб_УПКТ.еМайлРуководителя, """") КАК еМайлРуководителя,
	|	ЕСТЬNULL(гхб_УПКТ.еМайлФинансиста, """") КАК еМайлФинансиста,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Должность, ЗНАЧЕНИЕ(Справочник.гхб_ДолжностиОрганизацийБазХолдинга.ПустаяСсылка)) КАК Должность,
	|	ВЫБОР
	|		КОГДА гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован ЕСТЬ NULL
	|			ТОГДА ""Не актуализирован""
	|		КОГДА гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован = ИСТИНА
	|			ТОГДА ""Блокирован""
	|		КОГДА гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован = ЛОЖЬ
	|			ТОГДА ""Активен""
	|	КОНЕЦ КАК СтатусКабинета,
	|	гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Плательщик КАК Плательщик,
	|	ВЫБОР
	|		КОГДА втДатыОткрытия.ДатаОткрытия ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА втДатыЗакрытия.ДатаБлокирования ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА втДатыЗакрытия.ДатаБлокирования < втДатыОткрытия.ДатаОткрытия
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ втДатыЗакрытия.ДатаБлокирования
	|	КОНЕЦ КАК ДатаБлокирования,
	|	ЕСТЬNULL(втДатыОткрытия.ДатаОткрытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОткрытия,
	|	гхб_УПКТ.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.гхб_ПерсональныеКабинетыТакси КАК Справочникгхб_ПерсональныеКабинетыТакси
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних КАК гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гхб_УПКТ КАК гхб_УПКТ
	|			ПО гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Регистратор = гхб_УПКТ.Ссылка
	|		ПО Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.ПерсональныйКабинетТакси
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатыОткрытия КАК втДатыОткрытия
	|		ПО Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = втДатыОткрытия.ПерсональныйКабинетТакси
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатыЗакрытия КАК втДатыЗакрытия
	|		ПО Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = втДатыЗакрытия.ПерсональныйКабинетТакси
	|ГДЕ
	|	Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = &ПерсональныйКабинетТакси";
	
	Запрос.УстановитьПараметр("ПерсональныйКабинетТакси", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Текст = "Статус кабинета: " + Выборка.СтатусКабинета + Символы.ПС + Символы.ПС;
		
		Если Выборка.СтатусКабинета = "Не актуализирован" Тогда
			Возврат;
		КонецЕсли;
		
		Текст = Текст + "Дата открытия кабинета: " + Формат(Выборка.ДатаОткрытия, "ДФ=dd.MM.yyyy") + Символы.ПС + Символы.ПС;
		
		Если Выборка.СтатусКабинета = "Блокирован" Тогда
			Текст = Текст + "Дата блокирования кабинета: " + Формат(Выборка.ДатаБлокирования, "ДФ=dd.MM.yyyy") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
		Если Выборка.СтатусКабинета = "Блокирован" Тогда
			Текст = Текст + "Кабинет был закреплен за " + Выборка.Сотрудник + Символы.ПС;
		Иначе
			Текст = Текст + "Кабинет закреплен за " + Выборка.Сотрудник + Символы.ПС;
		КонецЕсли;
		
		Текст = Текст + "Должность: " + Выборка.Должность + Символы.ПС;
		Текст = Текст + "База холдинга: " + Выборка.БазаХолдинга + Символы.ПС;
		Текст = Текст + "Организация: " + Выборка.Организация + Символы.ПС;
		Текст = Текст + "Дивизион: " + Выборка.Дивизион + Символы.ПС;
		Текст = Текст + "ЦФО: " + Выборка.ЦФО + Символы.ПС + Символы.ПС;
		
		Текст = Текст + "Контактная информация сотрудника " + Символы.ПС;
		Текст = Текст + "Телефон: " + Выборка.ТелефонСотрудника + Символы.ПС;
		Текст = Текст + "e-mail: " + Выборка.еМайлСотрудника + Символы.ПС + Символы.ПС;
		
		Текст = Текст + "Руководитель: " + Выборка.Руководитель + Символы.ПС + Символы.ПС;
		Текст = Текст + "Контактная информация руководителя " + Символы.ПС;
		Текст = Текст + "Телефон: " + Выборка.ТелефонРуководителя + Символы.ПС;
		Текст = Текст + "e-mail: " + Выборка.еМайлРуководителя + Символы.ПС + Символы.ПС;
		
		Текст = Текст + "Финансист: " + Выборка.Финансист + Символы.ПС + Символы.ПС;
		Текст = Текст + "Контактная информация финансиста " + Символы.ПС;
		Текст = Текст + "Телефон: " + Выборка.ТелефонФинансиста + Символы.ПС;
		Текст = Текст + "e-mail: " + Выборка.еМайлФинансиста + Символы.ПС;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьУчетныеДанные()

#КонецОбласти
